import { useState, useEffect, useRef } from 'react';
import styled from 'styled-components';
import KoreaMap from './KoreaMap';
import {
  Region1,
  Region2,
  Region3,
  Region4,
  Region5,
  Region6,
  Region7,
  Region8,
  Region9,
  Region10,
  Region11,
  Region12,
  Region13,
  Region14,
  Region15,
  Region16,
  Region17
} from './regions';



function Map() {
  //오늘 날짜를 정수열로 1~31까지 가져옴
  const todayNum = new Date().getDate()
  // 0부터 요일순으로 정수
  const day = new Date().getDay()
  const week = ['일', '월', '화', '수', '목', '금', '토']
  const todayWord = week[day];
  console.log(todayWord, todayNum, day)

  return (
    <>
      <MapBox>
        <KoreaMap></KoreaMap>
      </MapBox>
      <RegionBox>
        <Region1/>
        <Region2/>
        <Region3/>
        <Region4/>
        <Region5/>
        <Region6/>
        <Region7/>
        <Region8/>
        <Region9/>
        <Region10/>
        <Region11/>
        <Region12/>
        <Region13/>
        <Region14/>
        <Region15/>
        <Region16/>
        <Region17/>
      </RegionBox>
    </>
  )
}

export default Map

const MapBox = styled.div`

`
const RegionBox = styled.div`
  position: absolute;
  width: 414px;
  height: 576px; 
  top: 30px;
  left: 0;
`

// 일 월 화 수 목 금 토 순으로 0부터
const dummyData: object = {
  0:[
    {'전체카운트': 20000},
    {'지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}}
  ],

  1:[
    {'전체카운트': 20000},
    {'지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}}  ],

  3: [
    {'전체카운트': 20000},
    {'지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}}  ],

  4: [
    {'전체카운트': 20000},
    {'지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}}  ],

  5: [
    {'전체카운트': 20000},
    {'지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}}  ],

  6: [
    {'전체카운트': 20000},
    {'지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}}  ],

  7: [
    {'전체카운트': 20000},
    {'지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}}  ],
}