import { useRecoilState } from 'recoil';
import axios from 'axios';
import { countData } from '../atom';
 

export default function CountDataIn() {

  // 일 월 화 수 목 금 토 순으로 0부터
  const dummyData = [
    {
      '요일':'일',
      '전체카운트': 20000,
      '지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}
    },
  
    {
      '요일':'월',
      '전체카운트': 20000,
      '지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}
    },
  
    {
      '요일':'화',
      '전체카운트': 20000,
      '지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}
    },
  
    {
      '요일':'수',
      '전체카운트': 20000,
      '지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}
    },
  
    {
      '요일':'목',
      '전체카운트': 20000,
      '지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}
    },
  
    {
      '요일':'금',
      '전체카운트': 20000,
      '지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}
    },
  
    {
      '요일':'토',
      '전체카운트': 20000,
      '지역별': {'서울': {'오늘':1004, '어제':1000}, '대구': {'오늘':1004, '어제':1000}, '인천': {'오늘':1004, '어제':1000}, '부산':{'오늘':1004, '어제':1000}, '광주':{'오늘':1004, '어제':1000}, '대전':{'오늘':1004, '어제':1000}, '울산':{'오늘':1004, '어제':1000}, '세종':{'오늘':1004, '어제':1000}, '경기':{'오늘':1004, '어제':1000}, '강원':{'오늘':1004, '어제':1000}, '충북':{'오늘':1004, '어제':1000}, '충남':{'오늘':1004, '어제':1000}, '전북':{'오늘':1004, '어제':1000}, '전남':{'오늘':1004, '어제':1000}, '경북':{'오늘':1004, '어제':1000}, '경남':{'오늘':1004, '어제':1000}, '제주':{'오늘':1004, '어제':1000}}
    },
  ]

  const [data, setCountData] = useRecoilState<Object>(countData)

  // 오늘 날짜를 정수열로 1~31까지 가져옴
  const todayNum = new Date().getDate()
  // 0부터 요일순으로 정수
  const day = new Date().getDay()
  const week = ['일', '월', '화', '수', '목', '금', '토']
  const todayWord = week[day]
  console.log(todayWord, todayNum, day)

  const BASE_URL = null

  type ops = {
    method: string,
    url: any
  }

  const option:ops = {
    method: 'get',
    url: BASE_URL
  }

  if (BASE_URL) {
    axios(option)
      .then(res => {
        console.log(res)
        setCountData(res.data)
      })
      .catch(err => {
        console.log(err)
      })
  } else {
    setCountData(dummyData)
  }

}